emacs_setup.org
#+TITLE: Paf's portable Emacs configuration
#+AUTHOR: Pascal Fleury
#+BABEL: :cache yes
#+PROPERTY: header-args :tangle yes

This is my Emacs config. You need to tangle this into a file that
then gets loaded by Emacs: =C-c C-v t= [org-babel-tangle].
Below, I also explain how this tangling is automated.

Extensive documentation about how to do this can be found [[https://github.com/larstvei/dot-emacs][here]].

* Plans
I regularly try out new packages, this is my current list of things being evaluated.
They usually live temporarily in my =~/.emacs= until I am happy, in
which case I move their config into this file so that it gets replicated on all
machines I work on with Emacs.

** Currently under review
  - [[https://github.com/myuhe/org-gcal.el][org-gcal]]
  - [[https://github.com/Kungsgeten/yankpad][yankpad]] + [[https://github.com/joaotavora/yasnippet][yasnippet]]
  - [[https://github.com/yjwen/org-reveal][ox-reveal]] (see [[https://github.com/yjwen/org-reveal#set-the-location-of-revealjs][installation]])

** Installed, but need no or external config
- [[https://github.com/edran/hc-zenburn-emacs][hc-zenburn-theme]]

* Setup
I have my config in directory =~/Emacs= which is where I clone this repository.
The config setup is maintained purely in the =~/Emacs/emacs_setup.org= file.

In your =~/.emacs= file, all you need to add is

#+NAME: emacs_bootstrap
#+BEGIN_SRC emacs-lisp :tangle no
;; Loads PAF's emacs setup with bootstrap
(load-file "~/Emacs/emacs_setup.el")
#+END_SRC

** Bootstrap
Initially when cloning this repository, you have the =emacs_setup.org= file,
that contains the config that you adapt to your specific setup, and an
=emacs_setup.el= with a bootstrap content that will tangle and compile the org
file, /and replace itself/. This is useful the very first time.

After that, the config itself should have the hook to re-tangle and re-compile
the setup at each save.

Therefore my setup is very easy to install, and it needs these steps:

1. clone this repo into =~/Emacs=
2. add the one line in you =~/.emacs=
3. make sure Emacs re-interprets its init (you could restart it)

It may be that [[https://github.com/jwiegley/use-package][use-package]] is not installed on your setup, so it will first try
to install that. After that step, it will also start installing any package that
is marked as needed in this config automatically.

The original content of the =emacs_setup.el= is as follows:

#+BEGIN_SRC emacs-lisp :tangle no
;; This file replaces itself with the actual configuration at first run.

(require 'org) ; We can't tangle without org!

(setq config_base (expand-file-name "emacs_setup"
				    (file-name-directory
				     (or load-file-name buffer-file-name))))
(find-file (concat config_base ".org"))        ; Open the configuration
(org-babel-tangle)                             ; tangle it
(load-file (concat config_base ".el"))         ; load it
(byte-compile-file (concat config_base ".el")) ; finally byte-compile it
#+END_SRC

** One-time configure
To preserve the original state of this file when updating the git repos
with new config settings, execute the following block once (=C-c C-c=):

#+BEGIN_SRC bash :file setup.sh :noweb yes
#!/bin/bash
git update-index --skip-worktree emacs_setup.el

# Add the load-file as the first thing in the user's ~/.emacs
declare lines=$(grep emacs_setup ~/.emacs | wc -l)
if (( lines < 1 )); then
  echo "Added loading the config in your ~/.emacs"
  cat > ~/.emacs.new <<EOF
<<emacs_bootstrap>>

EOF
  cat ~/.emacs >> ~/.emacs.new
  mv ~/.emacs.new ~/.emacs
else
  echo "Config in your ~/.emacs already set up!"
fi
#+END_SRC

#+RESULTS:
: Config in your ~/.emacs already set up!

* Initialize Emacs
** header
#+BEGIN_SRC emacs-lisp
;; ===== this file was auto-tangled, only edit the emacs_setup.org =====
#+END_SRC

** melpa
Make sure we have the package system initialized before we load anything.
#+BEGIN_SRC emacs-lisp
(require 'package)
(package-initialize)
#+END_SRC

Adding my choice of packages repositories.
#+NAME melpa-setup
#+BEGIN_SRC emacs-lisp
(setq package-archives '(("org" . "http://orgmode.org/elpa/")
                         ("melpa" . "http://melpa.org/packages/")
                         ("gnu" . "http://elpa.gnu.org/packages/")
                         ("marmalade" . "http://marmalade-repo.org/packages/")
                        ))
#+END_SRC
** use-package
I use =use-package= for most configuration, and that needs to be at the top of
the file.  =use-package= ensures requested the package is installed, if not it
installs it, and has very convenient sections for configs of variables, key
bindings etc. that happen only if the package is actually loaded.

First, make sure it gets installed if it is not there yet.
#+begin_src emacs-lisp
(unless (package-installed-p 'use-package)
        (package-refresh-contents)
        (package-install 'use-package))
#+end_src

#+BEGIN_SRC emacs-lisp
(eval-when-compile (require 'use-package))
#+END_SRC
** add-hook-run-once
Use instead of add-hook to run it a single time.
[[https://emacs.stackexchange.com/questions/3323/is-there-any-way-to-run-a-hook-function-only-once][found here]]
#+BEGIN_SRC emacs-lisp
(defmacro add-hook-run-once (hook function &optional append local)
  "Like add-hook, but remove the hook after it is called"
  (let ((sym (make-symbol "#once")))
    `(progn
       (defun ,sym ()
         (remove-hook ,hook ',sym ,local)
         (funcall ,function))
       (add-hook ,hook ',sym ,append ,local))))
#+END_SRC
** tangle-this-config
I set this up to tangle the init org-mode file into the actual Emacs init file as soon as I save it.
#+BEGIN_SRC emacs-lisp
(defun tangle-init ()
  "If the current buffer is 'init.org' the code-blocks are
tangled, and the tangled file is compiled."
  (when (equal (buffer-file-name)
               (expand-file-name "~/Emacs/emacs_setup.org"))
    ;; Avoid running hooks when tangling.
    (let ((prog-mode-hook nil))
      (org-babel-tangle)
      (byte-compile-file "~/Emacs/emacs_setup.el"))))

(add-hook 'after-save-hook 'tangle-init)
#+END_SRC
** Clear =C-p= so I can use it as a prefix
Remove =C-p= that I want to use for *me* personally as a prefix.
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-p") nil) ;; was 'previous-line'
#+END_SRC

** Speedup VCS
Regexp matching directory names that are not under VC's control.
The default regexp prevents fruitless and time-consuming attempts
to determine the VC status in directories in which filenames are
interpreted as hostnames.
#+BEGIN_SRC emacs-lisp
(defvar locate-dominating-stop-dir-regexp
  "\\`\\(?:[\\/][\\/][^\\/]+\\|/\\(?:net\\|afs\\|\\.\\.\\.\\)/\\)\\'")
#+END_SRC
** Access my remote Org files directory
Let's bind this to a key, so I can open remote dirs. I suually put
this in my =.emacs= as it is host- and user-specific.
#+begin_src emacs-lisp :tangle no
(defun paf/open-remote-org-dir ()
  (interactive)
  (dired "/ssh:remote.host.com:OrgFiles"))

(global-set-key (kbd "C-p r o") 'paf/open-remote-org-dir)
#+end_src

* Environment
** Browser default
#+BEGIN_SRC emacs-lisp
(setq browse-url-generic-program (executable-find "google-chrome")
  browse-url-browser-function 'browse-url-generic)
#+END_SRC
** Setup server
Start the background server, so we can use emacsclient.
#+begin_src emacs-lisp :tangle no
(server-start)
#+end_src
** UTF-8
 Make Emacs request UTF-8 first when pasting stuff.
#+BEGIN_SRC emacs-lisp
(use-package unicode-escape
  :ensure t
  :init
  (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)))
(set-language-environment "UTF-8")
#+END_SRC
** Newline (only Unix wanted)
This should autmoatically convert any files with dos or Mac line endings into Unix style ones.
Code found [[https://www.emacswiki.org/emacs/EndOfLineTips][here]].
#+begin_src emacs-lisp
  (defun no-junk-please-we-are-unixish ()
    (let ((coding-str (symbol-name buffer-file-coding-system)))
      (when (string-match "-\\(?:dos\\|mac\\)$" coding-str)
        (set-buffer-file-coding-system 'unix))))

  (add-hook 'find-file-hooks 'no-junk-please-we-are-unixish)
#+end_src
** Theme
I really like the high-contract Zenburn theme.
#+BEGIN_SRC emacs-lisp
(use-package hc-zenburn-theme
 :ensure t)
#+END_SRC
* Buffer behavior
Use =auto-revert=, which reloads a file if it's updated on disk
and not modified in the buffer.
#+BEGIN_SRC emacs-lisp
(global-auto-revert-mode 1)
(put 'upcase-region 'disabled nil)
(put 'narrow-to-region 'disabled nil)
#+END_SRC

* Managing Buffers
** winner-mode (layout managing)
Enables =winner-mode=.
Navigate buffer-window configs with =C-c left= and =C-c right=.
#+BEGIN_SRC emacs-lisp
(winner-mode 1)
#+END_SRC

** eyebrowse (layout managing)
This is supposed to be a better window manager.
#+BEGIN_SRC emacs-lisp
(use-package eyebrowse
  :ensure t)
#+END_SRC

** toggle-maximize-buffer
Temporarily maximize a buffer.
[[https://gist.github.com/mads379/3402786][found here]]
#+BEGIN_SRC emacs-lisp
(defun toggle-maximize-buffer () "Maximize buffer"
  (interactive)
  (if (= 1 (length (window-list)))
      (jump-to-register '_)
    (progn
      (window-configuration-to-register '_)
      (delete-other-windows))))
#+END_SRC

Map it to a key.
#+BEGIN_SRC emacs-lisp
(global-set-key [M-f8] 'toggle-maximize-buffer)
#+END_SRC
* Colors and Look
** Fontlock
This gets the font coloring switched on for all buffers.
*** TODO Note: this should be the default, maybe this can go ?
:LOGBOOK:
- State "TODO"       from              [2018-11-07 Wed 22:29]
:END:
#+BEGIN_SRC emacs-lisp
(global-font-lock-mode t)
#+END_SRC
** In terminal mode
#+BEGIN_SRC emacs-lisp
(when (display-graphic-p)
  (set-background-color "#ffffff")
  (set-foreground-color "#141312"))
#+END_SRC
** In X11 mode: mouse and window title
#+BEGIN_SRC emacs-lisp
(setq frame-title-format "emacs @ %b - %f")
(when window-system
  (mwheel-install)  ;; enable wheelmouse support by default
  (set-selection-coding-system 'compound-text-with-extensions))
#+END_SRC
** Look: buffer naming
#+BEGIN_SRC emacs-lisp
(use-package uniquify
  :init
  (setq uniquify-buffer-name-style 'post-forward-angle-brackets))
#+END_SRC
** Buffer Decorations
Setup the visual cues about the current editing buffer
#+BEGIN_SRC emacs-lisp
(column-number-mode 1)
(setq visible-bell t)
(setq scroll-step 1)
(setq-default transient-mark-mode t)  ;; highlight selection
#+END_SRC
** nyan-mode
#+BEGIN_SRC emacs-lisp
(use-package nyan-mode
  :ensure t
  :bind ("C-p n" . 'nyan-mode))
#+END_SRC
** dynamic cursor colors
The cursor is displayed in different colors, depending on overwrite or insert
mode.
#+BEGIN_SRC emacs-lisp
(setq hcz-set-cursor-color-color "")
(setq hcz-set-cursor-color-buffer "")

(defun hcz-set-cursor-color-according-to-mode ()
  "change cursor color according to some minor modes."
  ;; set-cursor-color is somewhat costly, so we only call it when needed:
  (let ((color
         (if buffer-read-only "orange"
           (if overwrite-mode "red"
             "green"))))
    (unless (and
             (string= color hcz-set-cursor-color-color)
             (string= (buffer-name) hcz-set-cursor-color-buffer))
      (set-cursor-color (setq hcz-set-cursor-color-color color))
      (setq hcz-set-cursor-color-buffer (buffer-name)))))

(add-hook 'post-command-hook 'hcz-set-cursor-color-according-to-mode)
#+END_SRC
* Key Mappings
** alternate key mappings
Letting one enter chars that are otherwise difficult in e.g. the minibuffer.
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-m") 'newline-and-indent)
(global-set-key (kbd "C-j") 'newline)
(global-set-key [delete] 'delete-char)
(global-set-key [kp-delete] 'delete-char)
#+END_SRC
** Macros
#+BEGIN_SRC emacs-lisp
(global-set-key [f3] 'start-kbd-macro)
(global-set-key [f4] 'end-kbd-macro)
(global-set-key [f5] 'call-last-kbd-macro)
#+END_SRC
** Text size
Increase/decrease text size
#+BEGIN_SRC emacs-lisp
(define-key global-map (kbd "C-+") 'text-scale-increase)
(define-key global-map (kbd "C--") 'text-scale-decrease)
#+END_SRC
** multiple regions
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-M-i") 'iedit-mode)
#+END_SRC
** Moving around buffers
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c <C-left>")  'windmove-left)
(global-set-key (kbd "C-c <C-right>") 'windmove-right)
(global-set-key (kbd "C-c <C-up>")    'windmove-up)
(global-set-key (kbd "C-c <C-down>")  'windmove-down)
(global-set-key (kbd "C-c C-g") 'goto-line)
#+END_SRC
** multiple-cursors
Configure the shortcuts for multiple cursors
#+BEGIN_SRC emacs-lisp
(use-package multiple-cursors
  :ensure t
  :bind (("C-S-c C-S-c" . 'mc/edit-lines)
         ("C->" . 'mc/mark-next-like-this)
         ("C-<" . 'mc/mark-previous-like-this)
         ("C-c C->" . 'mc/mark-all-like-this)))
#+END_SRC
** ace-jump-mode
Let's one jump around text
#+BEGIN_SRC emacs-lisp
(use-package ace-jump-mode
  :ensure t
  :bind (("C-c C-SPC" . 'ace-jump-mode)
         ("C-c C-DEL" . 'ace-jump-mode-pop-mark)))
#+END_SRC
* Editing Style
** No tabs, ever. No trailing spaces either.
#+BEGIN_SRC emacs-lisp
(setq-default indent-tabs-mode nil)
(setq require-final-newline t)
(setq next-line-add-newlines nil)
(add-hook 'before-save-hook 'delete-trailing-whitespace)
#+END_SRC
** Mark the 80 cols boundary
#+BEGIN_SRC emacs-lisp
(use-package column-marker
  :load-path "~/Emacs/"
  :config
  (add-hook 'c-mode-common-hook (lambda () (interactive) (column-marker-1 80)))
  :bind ("C-c m" . 'column-marker-1))
#+END_SRC
* Coding
** Projectile
Start using projectile. It has the documentation [[https://docs.projectile.mx/en/latest/][here]].
#+begin_src emacs-lisp
  (use-package projectile
    :ensure t
    :config
    (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
    (projectile-mode +1))

  (use-package helm-projectile
    :ensure t
    :requires projectile
    :config
    (helm-projectile-on))
#+end_src

Also make sure we do have the faster [[https://github.com/ggreer/the_silver_searcher#the-silver-searcher][silver searcher]] version.  This may need you
to install the corresponding tool for this, with the following snippet:
#+begin_src bash tangle: no
sudo apt-get install silversearcher-ag
#+end_src

Search the entire project with =C-c p s s= for a regexp.
This let's you turn the matching results into an editable buffer using
=C-c C-e=. Other keys are listed [[https://github.com/syohex/emacs-helm-ag#keymap][here]].

#+begin_src emacs-lisp
  (use-package helm-ag
    :ensure t)
#+end_src
** header/implementation toggle
Switch from header to implementation file quickly.
#+BEGIN_SRC emacs-lisp
(add-hook 'c-mode-common-hook
          (lambda ()
            (local-set-key  (kbd "C-c o") 'ff-find-other-file)))
#+END_SRC
** commenting out
Easy commenting out of lines.
#+BEGIN_SRC emacs-lisp
(autoload 'comment-out-region "comment" nil t)
(global-set-key (kbd "C-c q") 'comment-out-region)
#+END_SRC

